@php
    $user_id =  $conversation->user_id;
    $has_best =  $conversation->has_best;
@endphp
<div class="flexC gap-2">
    @if($user_id == auth()->id() or super())

        @if(!$obj->best and !$has_best)

            <div wire:click.debounce.150ms="best()" wire:loading.class="hidden">
                @component('component.btn.btnD',['title' => 'Mark as best answer' , 'color'=>'emerald'])
                    @slot('icon')
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" class="icon-md" height="24"
                             viewBox="0 0 24 24">
                            <path fill="currentColor"
                                  d="M12.795 2h-2c-1.886 0-2.829 0-3.414.586c-.586.586-.586 1.528-.586 3.414v3.5h10V6c0-1.886 0-2.828-.586-3.414C15.623 2 14.681 2 12.795 2Z"
                                  opacity=".5"/>
                            <path fill="currentColor" fill-rule="evenodd"
                                  d="M13.23 5.783a3 3 0 0 0-2.872 0L5.564 8.397A3 3 0 0 0 4 11.031v4.938a3 3 0 0 0 1.564 2.634l4.794 2.614a3 3 0 0 0 2.872 0l4.795-2.614a3 3 0 0 0 1.564-2.634V11.03a3 3 0 0 0-1.564-2.634L13.23 5.783ZM11.794 10.5c-.284 0-.474.34-.854 1.023l-.098.176c-.108.194-.162.29-.246.354c-.084.064-.19.088-.399.135l-.19.044c-.739.167-1.108.25-1.195.532c-.088.283.163.577.666 1.165l.13.152c.144.167.215.25.247.354c.032.104.022.215 0 .438l-.02.203c-.076.785-.114 1.178.116 1.352c.23.174.575.015 1.266-.303l.179-.082c.196-.09.294-.135.398-.135c.104 0 .203.045.399.135l.179.082c.69.319 1.036.477 1.266.303c.23-.174.192-.567.116-1.352l-.02-.203c-.022-.223-.033-.334 0-.438c.032-.103.103-.187.246-.354l.13-.152c.504-.588.755-.882.667-1.165c-.088-.282-.457-.365-1.194-.532l-.191-.044c-.21-.047-.315-.07-.399-.135c-.084-.064-.138-.16-.246-.354l-.098-.176c-.38-.682-.57-1.023-.855-1.023Z"
                                  clip-rule="evenodd"/>
                        </svg>
                    @endslot
                @endcomponent
            </div>

        @endif
{{--        @if($obj->best and $has_best)--}}
{{--            <div wire:click.debounce.150ms="deleteScore()" wire:loading.class="hidden">--}}
{{--                @component('component.btn.btnD',['title' => 'حذف عنوان بهترین پاسخ' , 'color'=>'rose'])--}}
{{--                    @slot('icon')--}}
{{--                        <svg xmlns="http://www.w3.org/2000/svg" width="24" class="icon-md" height="24"--}}
{{--                             viewBox="0 0 24 24">--}}
{{--                            <path fill="currentColor"--}}
{{--                                  d="M12.795 2h-2c-1.886 0-2.829 0-3.414.586c-.586.586-.586 1.528-.586 3.414v3.5h10V6c0-1.886 0-2.828-.586-3.414C15.623 2 14.681 2 12.795 2Z"--}}
{{--                                  opacity=".5"/>--}}
{{--                            <path fill="currentColor" fill-rule="evenodd"--}}
{{--                                  d="M13.23 5.783a3 3 0 0 0-2.872 0L5.564 8.397A3 3 0 0 0 4 11.031v4.938a3 3 0 0 0 1.564 2.634l4.794 2.614a3 3 0 0 0 2.872 0l4.795-2.614a3 3 0 0 0 1.564-2.634V11.03a3 3 0 0 0-1.564-2.634L13.23 5.783ZM11.794 10.5c-.284 0-.474.34-.854 1.023l-.098.176c-.108.194-.162.29-.246.354c-.084.064-.19.088-.399.135l-.19.044c-.739.167-1.108.25-1.195.532c-.088.283.163.577.666 1.165l.13.152c.144.167.215.25.247.354c.032.104.022.215 0 .438l-.02.203c-.076.785-.114 1.178.116 1.352c.23.174.575.015 1.266-.303l.179-.082c.196-.09.294-.135.398-.135c.104 0 .203.045.399.135l.179.082c.69.319 1.036.477 1.266.303c.23-.174.192-.567.116-1.352l-.02-.203c-.022-.223-.033-.334 0-.438c.032-.103.103-.187.246-.354l.13-.152c.504-.588.755-.882.667-1.165c-.088-.282-.457-.365-1.194-.532l-.191-.044c-.21-.047-.315-.07-.399-.135c-.084-.064-.138-.16-.246-.354l-.098-.176c-.38-.682-.57-1.023-.855-1.023Z"--}}
{{--                                  clip-rule="evenodd"/>--}}
{{--                        </svg>--}}
{{--                    @endslot--}}
{{--                @endcomponent--}}
{{--            </div>--}}
{{--        @endif--}}

    @endif
    @if($obj->best)
        @component('front.components.icon.numIcon',['color'=>'emerald','number' => 'best'])
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
                <g fill="none" stroke="currentColor" stroke-width="2.5">
                    <path
                        d="M2 12c0-4.714 0-7.071 1.464-8.536C4.93 2 7.286 2 12 2c4.714 0 7.071 0 8.535 1.464C22 4.93 22 7.286 22 12c0 4.714 0 7.071-1.465 8.535C19.072 22 16.714 22 12 22s-7.071 0-8.536-1.465C2 19.072 2 16.714 2 12Z"
                        opacity=".5"/>
                    <path stroke-linecap="round" stroke-linejoin="round" d="m8.5 12.5l2 2l5-5"/>
                </g>
            </svg>
        @endcomponent
    @endif

    <div>
        @include('component.loading.fullPage')
    </div>

</div>


