<?php

return [

    /*
    |--------------------------------------------------------------------------
    | تنظیمات امنیت لاگین
    |--------------------------------------------------------------------------
    |
    | این فایل تنظیمات مربوط به سیستم امنیت لاگین را تعیین می‌کند.
    |
    */

    // آیا فعال‌سازی میدلور به صورت خودکار انجام شود؟
    'enable_middleware' => true,

    // آیا ردیابی IP فعال باشد؟
    'track_ips' => true,

    // آیا ردیابی User-Agent فعال باشد؟
    'track_user_agent' => false,

    // آیا بررسی امنیتی IP فعال باشد؟
    'ip_security' => false,

    // آیا بررسی امنیتی User-Agent فعال باشد؟
    'user_agent_security' => false,

    // زمان انقضای لاگین (به روز)
    'expires_in_days' => 30,

    // حداکثر تعداد سشن همزمان برای هر کاربر (0 = نامحدود)
    'max_sessions_per_user' => 4,

    // آیا اطلاع‌رسانی در مورد فعالیت مشکوک انجام شود؟
    'notify_suspicious_activity' => false,

    // سطح بررسی اثر انگشت دستگاه (none, basic, medium, high)
    'fingerprint_level' => 'none',

    // آیا اجازه چند سشن همزمان داده شود؟
    'allow_multiple_sessions' => false,

    // آیا جمع‌آوری اطلاعات جغرافیایی بر اساس IP فعال باشد؟
    'geolocation_enabled' => false,

    // آیا چرخش توکن در هر بار استفاده انجام شود؟
    'token_rotation' => true,

    'strict_remember_me_ip' => false ,

    'strict_remember_me_ua' => true,
    //پاک کردن کوکی remember در مرورگر اگر موجود هست(در صورت عدم احراز هویت)
    'delete_remember_after_check_user' => false,
    'use_invalidated_token' => false,

    /*
    |--------------------------------------------------------------------------
    | کلاس‌های نوتیفیکیشن
    |--------------------------------------------------------------------------
    |
    | کلاس نوتیفیکیشن برای اطلاع‌رسانی رویدادهای مختلف
    |
    */

    'notifications' => [
//        'new_login' => \App\Notifications\NewLoginNotification::class,
//        'suspicious_login' => \App\Notifications\SuspiciousLoginNotification::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | تنظیمات پاکسازی خودکار
    |--------------------------------------------------------------------------
    |
    | تنظیمات مربوط به پاکسازی خودکار داده‌های قدیمی
    |
    */

    'cleanup' => [
        // آیا پاکسازی خودکار فعال باشد؟
        'enabled' => true,

        // حداکثر سن لاگین‌های منقضی شده برای نگهداری (به روز)
        'keep_expired_for_days' => 7,
    ],
];
